'''Задание 12.1. Создайте текстовый файл формата *.txt из нескольких строчек. Напишите
программу для чтения содержимого всего текстового файла. Отобразите результат на
экране'''

'''Задание 12.2. На вход программы подается натуральное число (не более 5). Создайте
текстовый файл формата *.txt из 8 строчек. Напишите программу для чтения первых n строк
файла. Отобразите результат на экране.'''

'''Задание 12.3. Создайте текстовый файл формата *.txt из нескольких строчек. Напишите
программу для чтения содержимого файла и сохранения его в списке. Отобразите
результат на экране.'''

'''Задание 12.4. Создайте текстовый файл формата *.txt из нескольких строчек и не менее 50
слов. Напишите программу для поиска и вывода на экран самого длинного слова из файла.'''

'''Задание 12.5. Создайте текстовый файл формата *.txt из нескольких строчек. Напишите
программу для подсчета количества строк в текстовом файле. Выведите их количество на
экран.'''

'''Задание 12.6. Создайте текстовый файл формата *.txt из нескольких строчек и не менее 50
слов. Напишите программу для подсчета частоты слов в файле (сколько раз встречается
каждое слово). Выведите слова и частоту их появления на экран в порядке от самого часто
употребляемого слова к менее употребляемому.'''

'''Задание 12.7. Вводятся слова в одну строку через пробел. Создайте из этих слов список.
Запишите эти слова, упорядоченные по алфавиту, каждое с новой строки, в текстовый файл
формата *.txt. После этого прочитайте содержимое файла и выведите его на экран.'''